* TODO Pandas 소개

#+BEGIN_SRC ipython :session :exports none
  %matplotlib inline
  from tabulate import tabulate

  def tab(df):
      print(tabulate(df, headers='keys', tablefmt='orgtbl'))
#+END_SRC

Pandas는 Python으로 작성된 데이터 분석 도구입니다. Python의 패키지 형태로 제공되어, Python 언어 내에 쉽게 섞어 사용할 수 있습니다.

 - [X] Data structure
   - [X] Series
   - [X] DataFrame
     - [X] Creation
       - [X] from_dict()
     - [X] .shape
     - [X] .columns
     - [X] Sort
       - [X] sort_index()
       - [X] sort_values()
       - [X] rank()
     - [X] rename()
   - [X] Index
     - [X] reindex()
     - [X] set_index()
     - [X] reset_index()
 - [X] Row/Column selection
   - [X] head()
   - [X] tail()
   - [X] sampling
     - [X] sample(n=10)
     - [X] sample(frac=0.6)
   - [X] slicing
   - [X] Boolean indexing
   - [X] where()
 - [ ] Data Transform
   - [ ] map()
   - [ ] apply()
   - [ ] applymap()
 - [ ] Reshaping
   - [ ] merge()
   - [ ] melt()
   - [ ] crosstab()
   - [ ] pivot_table()
     - [ ] margins
   - [ ] groupby()
 - [ ] Data Type
   - [ ] astype()
   - [ ] to_numeric()
   - [ ] to_datetime()
   - [ ] to_timedelta()


** Data structure

Pandas에서 주요한 데이터 요소로, ~Series~ 와 ~DataFrame~ 이 있습니다.

~Series~ 는 1차원 배열이라고 볼 수 있습니다. 간단한 예는 아래와 같습니다.

#+BEGIN_SRC ipython :session :results raw :exports both
  import pandas as pd
  s = pd.Series([17.8, 25.3, 18.2, 3, 5])
  s
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
  0    1
  1    2
  2    3
  3    4
  4    5
  dtype: int64
#+END_EXAMPLE

Series에 여러 가지 정보를 덧붙일 수 있습니다.

#+BEGIN_SRC ipython :session :results raw :exports both
  import pandas as pd
  population = pd.Series([51181299, 8468555, 1281935911, 10248069, 53950935],
                         index=['한국', '타지키스탄', '인도', '요르단', '탄자니아'],
                         name='인구')
  population
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
  한국         51181299
  타지키스탄       8468555
  인도       1281935911
  요르단        10248069
  탄자니아       53950935
  Name: 인구, dtype: int64
#+END_EXAMPLE

#+BEGIN_SRC ipython :session :results raw :exports both
  import pandas as pd
  index = ['한국', '타지키스탄', '인도', '요르단', '탄자니아']
  birth_rate = pd.Series([8.3, 23.3, 19, 23.9, 35.6],
                         index=index,
                         name='출산율(1000명당)')
  unemployment_rate = pd.Series([0.107, 0.167, 0.107, 0.293, 0.094],
                                index=index,
                                name='실업율(15-24세)')
#+END_SRC

~DataFrame~ 은 여러개의 ~Series~ 를 모아놓은 것입니다. 간단히 여러 행과 열로 이루어진 엑셀 시트를 생각하시면 되겠습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
  import pandas as pd
  df_countries = pd.DataFrame({'인구': population, '출산율(1000명당)': birth_rate, '실업율(15-24세)': unemployment_rate})
  df_countries
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_countries)
#+END_SRC
#+RESULTS:
|            | 실업율(15-24세) |        인구 | 출산율(1000명당) |
|------------+-----------------+-------------+------------------|
| 한국       |           0.107 | 5.11813e+07 |              8.3 |
| 타지키스탄 |           0.167 | 8.46856e+06 |             23.3 |
| 인도       |           0.107 | 1.28194e+09 |               19 |
| 요르단     |           0.293 | 1.02481e+07 |             23.9 |
| 탄자니아   |           0.094 | 5.39509e+07 |             35.6 |

~DataFrame~ 의 모양, 그리고 컬럼 목록을 아래와 같이 확인할 수 있습니다.

#+BEGIN_SRC ipython :session :results output :exports both
  print(df_countries.shape)
  print(df_countries.columns)
#+END_SRC

#+RESULTS:
: (5, 3)
: Index(['실업율(15-24세)', '인구', '출산율(1000명당)'], dtype='object')


~Series~ 를 통하지 않고 곧바로 ~DataFrame~ 을 생성할 수 있습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
  import pandas as pd
  df_countries = pd.DataFrame([[51181299, 8.3, 0.107],
                               [8468555, 23.3, 0.167],
                               [1281935911, 19, 0.107],
                               [10248069, 23.9, 0.293],
                               [53950935, 35.6, 0.094]],
                              index=['한국', '타지키스탄', '인도', '요르단', '탄자니아'],
                              columns=['인구', '출산율(1000명당)', '실업율(15-24세)'])
  df_countries
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_countries)
#+END_SRC

#+RESULTS:
|            |        인구 | 출산율(1000명당) | 실업율(15-24세) |
|------------+-------------+------------------+-----------------|
| 한국       | 5.11813e+07 |              8.3 |           0.107 |
| 타지키스탄 | 8.46856e+06 |             23.3 |           0.167 |
| 인도       | 1.28194e+09 |               19 |           0.107 |
| 요르단     | 1.02481e+07 |             23.9 |           0.293 |
| 탄자니아   | 5.39509e+07 |             35.6 |           0.094 |


웹으로부터 JSON 데이터를 가져오는 경우에는 데이터가 ~dict~ 형태가 됩니다.


#+BEGIN_SRC javascript
  json_data = [
    {"이름": "한국", "인구": 51181299, "출산율(1000명당)": 8.3, "실업율(15-24세)": 0.107},
    {"이름": "타지키스탄", "인구": 8468555, "출산율(1000명당)": 23.3, "실업율(15-24세)": 0.167},
    {"이름": "인도", "인구": 1281935911, "출산율(1000명당)": 19, "실업율(15-24세)": 0.107},
    {"이름": "요르단", "인구": 10248069, "출산율(1000명당)": 23.9, "실업율(15-24세)": 0.293},
    {"이름": "탄자니아", "인구": 53950935, "출산율(1000명당)": 35.6, "실업율(15-24세)": 0.094}
  ]
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports none
  json_data = [
    {"이름": "한국", "인구": 51181299, "출산율(1000명당)": 8.3, "실업율(15-24세)": 0.107},
    {"이름": "타지키스탄", "인구": 8468555, "출산율(1000명당)": 23.3, "실업율(15-24세)": 0.167},
    {"이름": "인도", "인구": 1281935911, "출산율(1000명당)": 19, "실업율(15-24세)": 0.107},
    {"이름": "요르단", "인구": 10248069, "출산율(1000명당)": 23.9, "실업율(15-24세)": 0.293},
    {"이름": "탄자니아", "인구": 53950935, "출산율(1000명당)": 35.6, "실업율(15-24세)": 0.094}
  ]
#+END_SRC

#+BEGIN_SRC ipython :session :results raw :exports code
  df_countries = pd.DataFrame.from_dict(json_data)
  df_countries
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
  tab(df_countries)
#+END_SRC

#+RESULTS:
|   | 실업율(15-24세) | 이름       |       인구 | 출산율(1000명당) |
|---+-----------------+------------+------------+------------------|
| 0 |           0.107 | 한국       |   51181299 |              8.3 |
| 1 |           0.167 | 타지키스탄 |    8468555 |             23.3 |
| 2 |           0.107 | 인도       | 1281935911 |               19 |
| 3 |           0.293 | 요르단     |   10248069 |             23.9 |
| 4 |           0.094 | 탄자니아   |   53950935 |             35.6 |

그런데 이 경우에는 다른 경우와는 달리 국가명이 일반 컬럼으로 들어가 있습니다. 이렇듯 특정 컬럼을 인덱스로 만들기 위해서는 아래와 같이 합니다.

#+BEGIN_SRC ipython :session :results raw :exports code
  df_countries = df_countries.set_index('이름')
  df_countries
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
  tab(df_countries)
#+END_SRC
#+RESULTS:
| 이름       | 실업율(15-24세) |        인구 | 출산율(1000명당) |
|------------+-----------------+-------------+------------------|
| 한국       |           0.107 | 5.11813e+07 |              8.3 |
| 타지키스탄 |           0.167 | 8.46856e+06 |             23.3 |
| 인도       |           0.107 | 1.28194e+09 |               19 |
| 요르단     |           0.293 | 1.02481e+07 |             23.9 |
| 탄자니아   |           0.094 | 5.39509e+07 |             35.6 |

인덱스를 해제하여 일반 컬럼으로 만들기 위해서는 ~reset_index~ 를 사용합니다.

#+BEGIN_SRC ipython :session :results raw :exports code
  df_countries.reset_index()
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
  tab(df_countries.reset_index())
#+END_SRC

#+RESULTS:
|   | 이름       | 실업율(15-24세) |       인구 | 출산율(1000명당) |
|---+------------+-----------------+------------+------------------|
| 0 | 한국       |           0.107 |   51181299 |              8.3 |
| 1 | 타지키스탄 |           0.167 |    8468555 |             23.3 |
| 2 | 인도       |           0.107 | 1281935911 |               19 |
| 3 | 요르단     |           0.293 |   10248069 |             23.9 |
| 4 | 탄자니아   |           0.094 |   53950935 |             35.6 |

행이나 열의 순서를 바꾸고자 할 때에는 ~reindex~ 메소드를 사용합니다. 이름은 ~reindex~ 이지만, 인덱스 외에도 컬럼의 순서도 조정할 수 있습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
  df_countries.reset_index().reindex([2, 4, 3, 0, 1], columns=['출산율(1000명당)', '실업율(15-24세)', '인구'])
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports both
  tab(df_countries.reset_index().reindex([2, 4, 3, 0, 1], columns=['출산율(1000명당)', '실업율(15-24세)', '인구']))
#+END_SRC
#+RESULTS:
|   | 출산율(1000명당) | 실업율(15-24세) |        인구 |
|---+------------------+-----------------+-------------|
| 2 |               19 |           0.107 | 1.28194e+09 |
| 4 |             35.6 |           0.094 | 5.39509e+07 |
| 3 |             23.9 |           0.293 | 1.02481e+07 |
| 0 |              8.3 |           0.107 | 5.11813e+07 |
| 1 |             23.3 |           0.167 | 8.46856e+06 |

실업율이 높은 순서대로 한 번 살펴볼까요?

#+BEGIN_SRC ipython :session :results raw :exports code
  df_countries.sort_values('실업율(15-24세)', ascending=False)
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
  tab(df_countries.sort_values('실업율(15-24세)', ascending=False))
#+END_SRC

#+RESULTS:
|            | 실업율(15-24세) |        인구 | 출산율(1000명당) |
|------------+-----------------+-------------+------------------|
| 요르단     |           0.293 | 1.02481e+07 |             23.9 |
| 타지키스탄 |           0.167 | 8.46856e+06 |             23.3 |
| 한국       |           0.107 | 5.11813e+07 |              8.3 |
| 인도       |           0.107 | 1.28194e+09 |               19 |
| 탄자니아   |           0.094 | 5.39509e+07 |             35.6 |

~ascending~ 옵션을 주지 않으면 오름차순으로 정렬합니다.

이번엔 인덱스 순서, 즉 국가 이름 순서대로 정렬을 해봅시다.

#+BEGIN_SRC ipython :session :results raw :exports code
  df_countries.sort_index(ascending=False)
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
  tab(df_countries.sort_index(ascending=False))
#+END_SRC

#+RESULTS:
|            | 실업율(15-24세) |        인구 | 출산율(1000명당) |
|------------+-----------------+-------------+------------------|
| 한국       |           0.107 | 5.11813e+07 |              8.3 |
| 탄자니아   |           0.094 | 5.39509e+07 |             35.6 |
| 타지키스탄 |           0.167 | 8.46856e+06 |             23.3 |
| 인도       |           0.107 | 1.28194e+09 |               19 |
| 요르단     |           0.293 | 1.02481e+07 |             23.9 |

위에서 index 지정이나 해제, 정렬 등을 할 때 살펴봤듯이, pandas에서 대부분의 행동은 원본 데이터를 수정하지 않고 복사본을 반환하는 형태로 동작합니다.

눈으로 정렬해서 보는 것 말고, 수치화해서 나타내려면 어떻게 할까요?

#+BEGIN_SRC ipython :session :results raw :exports code
  df_countries.rank()
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
  tab(df_countries.rank())
#+END_SRC

#+RESULTS:
|            | 실업율(15-24세) | 인구 | 출산율(1000명당) |
|------------+-----------------+------+------------------|
| 한국       |             2.5 |    3 |                1 |
| 타지키스탄 |               4 |    1 |                3 |
| 인도       |             2.5 |    5 |                2 |
| 요르단     |               5 |    2 |                4 |
| 탄자니아   |               1 |    4 |                5 |

~실업율(15-24세)~ 컬럼 이름이 너무 길어서 불편합니다. 인덱스나 컬럼의 이름을 변경하려면 어떻게 할까요?

#+BEGIN_SRC ipython :session :results raw :exports code
  df_countries.rename(index={'한국': '대한민국'}, columns={'실업율(15-24세)': '실업율'})
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
  tab(df_countries.rename(index={'한국': '대한민국'}, columns={'실업율(15-24세)': '실업율'}))
#+END_SRC

#+RESULTS:
|            |        인구 | 출산율(1000명당) | 실업율 |
|------------+-------------+------------------+--------|
| 대한민국   | 5.11813e+07 |              8.3 |  0.107 |
| 타지키스탄 | 8.46856e+06 |             23.3 |  0.167 |
| 인도       | 1.28194e+09 |               19 |  0.107 |
| 요르단     | 1.02481e+07 |             23.9 |  0.293 |
| 탄자니아   | 5.39509e+07 |             35.6 |  0.094 |


** Row/Column selection

이 섹션을 진행하기 위해, 조금 더 많은 row를 가진 데이터를 불러들여봅시다.

#+BEGIN_SRC ipython :session :exports code :results raw
  df_dtype = pd.read_excel('assets/엑셀과정실습생.xlsx', sheet_name='Sheet1',
                           index_col=0,
                           dtype={'번호': 'object', '성별': 'object', '즐기는 음식': 'object'})
#+END_SRC

데이터가 잘 불러들여졌는지 확인해봅시다. 데이터가 큰 경우에는 전체 데이터를 출력해서 살펴보기가 어려울 수 있습니다. 이럴 때는 맨 앞의 데이터 일부, 맨 뒤의 데이터 일부를 살펴볼 수 있겠습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
df_dtype.head()
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_dtype.head())
#+END_SRC

#+RESULTS:
| 번호 | 나이 | 성별 | 신장(cm) | 몸무게(kg) | 즐기는 음식 |
|------+------+------+----------+------------+-------------|
|    1 |   30 |    1 |      183 |         82 |           1 |
|    2 |   28 |    2 |      160 |         62 |           3 |
|    3 |   27 |    1 |      178 |         77 |           2 |
|    4 |   23 |    1 |      172 |         70 |           2 |
|    5 |   25 |    1 |      168 |         72 |           3 |

#+BEGIN_SRC ipython :session :results raw :exports code
df_dtype.tail()
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_dtype.tail())
#+END_SRC

#+RESULTS:
| 번호 | 나이 | 성별 | 신장(cm) | 몸무게(kg) | 즐기는 음식 |
|------+------+------+----------+------------+-------------|
|   16 |   33 |    1 |      177 |         72 |           2 |
|   17 |   38 |    2 |      159 |         55 |           1 |
|   18 |   26 |    1 |      166 |         69 |           3 |
|   19 |   26 |    1 |      169 |         66 |           2 |
|   20 |   28 |    2 |      159 |         60 |           2 |

무작위로 데이터의 일부 row만을 샘플링해서 추출하려면 아래와 같이 할 수 있습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
df_dtype.sample(n=5)
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_dtype.sample(n=5))
#+END_SRC

#+RESULTS:
| 번호 | 나이 | 성별 | 신장(cm) | 몸무게(kg) | 즐기는 음식 |
|------+------+------+----------+------------+-------------|
|    1 |   30 |    1 |      183 |         82 |           1 |
|    4 |   23 |    1 |      172 |         70 |           2 |
|   20 |   28 |    2 |      159 |         60 |           2 |
|    3 |   27 |    1 |      178 |         77 |           2 |
|   12 |   26 |    1 |      173 |         70 |           2 |

샘플의 크기를 비율로 정할 수도 있습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
df_dtype.sample(frac=0.2)
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_dtype.sample(frac=0.2))
#+END_SRC

#+RESULTS:
| 번호 | 나이 | 성별 | 신장(cm) | 몸무게(kg) | 즐기는 음식 |
|------+------+------+----------+------------+-------------|
|   10 |   31 |    1 |      183 |         77 |           3 |
|   19 |   26 |    1 |      169 |         66 |           2 |
|   18 |   26 |    1 |      166 |         69 |           3 |
|   17 |   38 |    2 |      159 |         55 |           1 |

행이나 열을 잘라내는 방법을 살펴봅시다.

아래와 같이 특정 구간의 행을 잘라낼 수 있습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
df_dtype[2:5]
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_dtype[2:5])
#+END_SRC

#+RESULTS:
| 번호 | 나이 | 성별 | 신장(cm) | 몸무게(kg) | 즐기는 음식 |
|------+------+------+----------+------------+-------------|
|    3 |   27 |    1 |      178 |         77 |           2 |
|    4 |   23 |    1 |      172 |         70 |           2 |
|    5 |   25 |    1 |      168 |         72 |           3 |

특정 컬럼을 선택하는 것은 아래와 같이 할 수 있습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
df_dtype[['즐기는 음식','성별']]
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_dtype[['즐기는 음식','성별']])
#+END_SRC

#+RESULTS:
| 번호 | 즐기는 음식 | 성별 |
|------+-------------+------|
|    1 |           1 |    1 |
|    2 |           3 |    2 |
|    3 |           2 |    1 |
|    4 |           2 |    1 |
|    5 |           3 |    1 |
|    6 |           1 |    1 |
|    7 |           1 |    1 |
|    8 |           3 |    1 |
|    9 |           2 |    2 |
|   10 |           3 |    1 |
|   11 |           1 |    2 |
|   12 |           2 |    1 |
|   13 |           3 |    1 |
|   14 |           3 |    1 |
|   15 |           2 |    2 |
|   16 |           2 |    1 |
|   17 |           1 |    2 |
|   18 |           3 |    1 |
|   19 |           2 |    1 |
|   20 |           2 |    2 |

~DataFrame~ 에 대해서는 조건문을 적용할 수 있습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
df_dtype > 2
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_dtype > 2)
#+END_SRC

#+RESULTS:
| 번호 | 나이 | 성별 | 신장(cm) | 몸무게(kg) | 즐기는 음식 |
|------+------+------+----------+------------+-------------|
|    1 |    1 |    0 |        1 |          1 |           0 |
|    2 |    1 |    0 |        1 |          1 |           1 |
|    3 |    1 |    0 |        1 |          1 |           0 |
|    4 |    1 |    0 |        1 |          1 |           0 |
|    5 |    1 |    0 |        1 |          1 |           1 |
|    6 |    1 |    0 |        1 |          1 |           0 |
|    7 |    1 |    0 |        1 |          1 |           0 |
|    8 |    1 |    0 |        1 |          1 |           1 |
|    9 |    1 |    0 |        1 |          1 |           0 |
|   10 |    1 |    0 |        1 |          1 |           1 |
|   11 |    1 |    0 |        1 |          1 |           0 |
|   12 |    1 |    0 |        1 |          1 |           0 |
|   13 |    1 |    0 |        1 |          1 |           1 |
|   14 |    1 |    0 |        1 |          1 |           1 |
|   15 |    1 |    0 |        1 |          1 |           0 |
|   16 |    1 |    0 |        1 |          1 |           0 |
|   17 |    1 |    0 |        1 |          1 |           0 |
|   18 |    1 |    0 |        1 |          1 |           1 |
|   19 |    1 |    0 |        1 |          1 |           0 |
|   20 |    1 |    0 |        1 |          1 |           0 |

성별 값이 1인 경우를 선택해봅시다. 우선 성별이 1인지 여부를 나타내는 벡터를 생성합니다.

#+BEGIN_SRC ipython :session :results raw :exports both
df_dtype['성별'] == 1
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
번호
  1      True
  2     False
  3      True
  4      True
  5      True
  6      True
  7      True
  8      True
  9     False
  10     True
  11    False
  12     True
  13     True
  14     True
  15    False
  16     True
  17    False
  18     True
  19     True
  20    False
  Name: 성별, dtype: bool
#+END_EXAMPLE

그리고 그 벡터를 ~DataFrame~ 에 다시 넣어줍니다.

#+BEGIN_SRC ipython :session :results raw :exports code
  df_dtype[df_dtype['성별'] == 1]
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
  tab(df_dtype[df_dtype['성별'] == 1])
#+END_SRC

#+RESULTS:
| 번호 | 나이 | 성별 | 신장(cm) | 몸무게(kg) | 즐기는 음식 |
|------+------+------+----------+------------+-------------|
|    1 |   30 |    1 |      183 |         82 |           1 |
|    3 |   27 |    1 |      178 |         77 |           2 |
|    4 |   23 |    1 |      172 |         70 |           2 |
|    5 |   25 |    1 |      168 |         72 |           3 |
|    6 |   27 |    1 |      179 |         77 |           1 |
|    7 |   26 |    1 |      169 |         71 |           1 |
|    8 |   29 |    1 |      171 |         75 |           3 |
|   10 |   31 |    1 |      183 |         77 |           3 |
|   12 |   26 |    1 |      173 |         70 |           2 |
|   13 |   35 |    1 |      173 |         68 |           3 |
|   14 |   24 |    1 |      176 |         66 |           3 |
|   16 |   33 |    1 |      177 |         72 |           2 |
|   18 |   26 |    1 |      166 |         69 |           3 |
|   19 |   26 |    1 |      169 |         66 |           2 |

특정한 조건의 셀에서 값을 없애고 싶은 경우가 있습니다. 그런 경우는 아래와 같이 ~where()~ 구문을 사용합니다.

#+BEGIN_SRC ipython :session :results raw :exports code
df_dtype.where(df_dtype['성별'] > 1)
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_dtype.where(df_dtype['성별'] > 1))
#+END_SRC

#+RESULTS:
| 번호 | 나이 | 성별 | 신장(cm) | 몸무게(kg) | 즐기는 음식 |
|------+------+------+----------+------------+-------------|
|    1 |  nan |  nan |      nan |        nan |         nan |
|    2 |   28 |    2 |      160 |         62 |           3 |
|    3 |  nan |  nan |      nan |        nan |         nan |
|    4 |  nan |  nan |      nan |        nan |         nan |
|    5 |  nan |  nan |      nan |        nan |         nan |
|    6 |  nan |  nan |      nan |        nan |         nan |
|    7 |  nan |  nan |      nan |        nan |         nan |
|    8 |  nan |  nan |      nan |        nan |         nan |
|    9 |   34 |    2 |      158 |         60 |           2 |
|   10 |  nan |  nan |      nan |        nan |         nan |
|   11 |   26 |    2 |      162 |         59 |           1 |
|   12 |  nan |  nan |      nan |        nan |         nan |
|   13 |  nan |  nan |      nan |        nan |         nan |
|   14 |  nan |  nan |      nan |        nan |         nan |
|   15 |   29 |    2 |      170 |         70 |           2 |
|   16 |  nan |  nan |      nan |        nan |         nan |
|   17 |   38 |    2 |      159 |         55 |           1 |
|   18 |  nan |  nan |      nan |        nan |         nan |
|   19 |  nan |  nan |      nan |        nan |         nan |
|   20 |   28 |    2 |      159 |         60 |           2 |

~where~ 구문에는 ~DataFrame~ 도 인자로 줄 수 있습니다.

#+BEGIN_SRC ipython :session :results raw :exports code
df_dtype.where(df_dtype > 1)
#+END_SRC

#+BEGIN_SRC ipython :session :results raw output :exports result
tab(df_dtype.where(df_dtype > 1))
#+END_SRC

#+RESULTS:
| 번호 | 나이 | 성별 | 신장(cm) | 몸무게(kg) | 즐기는 음식 |
|------+------+------+----------+------------+-------------|
|    1 |   30 |  nan |      183 |         82 |         nan |
|    2 |   28 |    2 |      160 |         62 |           3 |
|    3 |   27 |  nan |      178 |         77 |           2 |
|    4 |   23 |  nan |      172 |         70 |           2 |
|    5 |   25 |  nan |      168 |         72 |           3 |
|    6 |   27 |  nan |      179 |         77 |         nan |
|    7 |   26 |  nan |      169 |         71 |         nan |
|    8 |   29 |  nan |      171 |         75 |           3 |
|    9 |   34 |    2 |      158 |         60 |           2 |
|   10 |   31 |  nan |      183 |         77 |           3 |
|   11 |   26 |    2 |      162 |         59 |         nan |
|   12 |   26 |  nan |      173 |         70 |           2 |
|   13 |   35 |  nan |      173 |         68 |           3 |
|   14 |   24 |  nan |      176 |         66 |           3 |
|   15 |   29 |    2 |      170 |         70 |           2 |
|   16 |   33 |  nan |      177 |         72 |           2 |
|   17 |   38 |    2 |      159 |         55 |         nan |
|   18 |   26 |  nan |      166 |         69 |           3 |
|   19 |   26 |  nan |      169 |         66 |           2 |
|   20 |   28 |    2 |      159 |         60 |           2 |


** Data Transform



** Reshaping

** Data Type Conversion
